In [1]:
import numpy as np
import pandas as pd

In [2]:
medals = pd.read_csv("./data/Medals.csv")

In [3]:
medals.head(10)

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8.0
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8.0
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6.0
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6.0
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6.0
5,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5.0
6,Missy Franklin,17.0,2012,08/12/2012,4,0,1,5.0
7,Ryan Lochte,27.0,2012,08/12/2012,2,2,1,5.0
8,Allison Schmitt,22.0,2012,08/12/2012,3,1,1,5.0
9,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5.0

In [4]:
athlete_country = pd.read_csv("./data/Athelete_Country_Map.csv")

athlete_sports = pd.read_csv("./data/Athelete_Sports_Map.csv")

In [5]:
athlete_country_dd = athlete_country.drop_duplicates(subset='Athlete')
merged_ac = pd.merge(left=medals, right=athlete_country_dd, left_on='Athlete', right_on='Athlete')

merged_ac

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8.0,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8.0,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6.0,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6.0,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5.0,United States
...,...,...,...,...,...,...,...,...,...
8526,Olena Sadovnycha,32.0,2000,10/01/2000,0,1,0,1.0,Ukraine
8527,Kateryna Serdiuk,17.0,2000,10/01/2000,0,1,0,1.0,Ukraine
8528,Wietse van Alten,21.0,2000,10/01/2000,0,0,1,1.0,Netherlands
8529,Sandra Wagner-Sachse,31.0,2000,10/01/2000,0,0,1,1.0,Germany
8530,Rod White,23.0,2000,10/01/2000,0,0,1,1.0,United States

In [6]:
len(merged_ac)

8531

In [7]:
athlete_sports_dd = athlete_sports.drop_duplicates(subset='Athlete')

len(athlete_sports_dd)

6956

In [8]:
merged_result = pd.merge(left=merged_ac, right=athlete_sports_dd, left_on='Athlete', right_on='Athlete')

merged_result

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8.0,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8.0,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6.0,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6.0,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5.0,United States,Swimming
...,...,...,...,...,...,...,...,...,...,...
8526,Olena Sadovnycha,32.0,2000,10/01/2000,0,1,0,1.0,Ukraine,Archery
8527,Kateryna Serdiuk,17.0,2000,10/01/2000,0,1,0,1.0,Ukraine,Archery
8528,Wietse van Alten,21.0,2000,10/01/2000,0,0,1,1.0,Netherlands,Archery
8529,Sandra Wagner-Sachse,31.0,2000,10/01/2000,0,0,1,1.0,Germany,Archery
8530,Rod White,23.0,2000,10/01/2000,0,0,1,1.0,United States,Archery

In [9]:
## Solution 2 Start!

# 한국의 모든 메달리스트 구하기 (중복 포함)
korea_result = merged_result[merged_result['Country'] == 'South Korea']

korea_result

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
43,An Hyeon-Su,20.0,2006,02/26/2006,3,0,1,4.0,South Korea,Short-Track Speed Skating
133,Lee Jeong-Su,20.0,2010,02/28/2010,2,1,0,3.0,South Korea,Short-Track Speed Skating
139,Jin Seon-Yu,17.0,2006,02/26/2006,3,0,0,3.0,South Korea,Short-Track Speed Skating
140,Lee Ho-Seok,19.0,2006,02/26/2006,1,2,0,3.0,South Korea,Short-Track Speed Skating
141,Lee Ho-Seok,23.0,2010,02/28/2010,0,2,0,2.0,South Korea,Short-Track Speed Skating
...,...,...,...,...,...,...,...,...,...,...
8497,Lee Chang-Hwan,26.0,2008,08/24/2008,1,0,0,1.0,South Korea,Archery
8508,Jang Yong-Ho,28.0,2004,08/29/2004,1,0,0,1.0,South Korea,Archery
8509,Jang Yong-Ho,24.0,2000,10/01/2000,1,0,0,1.0,South Korea,Archery
8522,Kim Cheong-Tae,20.0,2000,10/01/2000,1,0,0,1.0,South Korea,Archery
8524,O Gyo-Mun,28.0,2000,10/01/2000,1,0,0,1.0,South Korea,Archery

In [10]:
# 1. 대한민국의 연도별로 메달 집계하기

# 'Year'를 기준으로 Groupby를 진행한다. -> sum() 통계함수로 메달의 합을 구하고 그 중에서 메달에 관련한 Column만 추출한다.
kr_result_by_year = korea_result.groupby('Year').sum()[['Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals']]

# 결과를 출력한다.
kr_result_by_year

      Gold Medals  Silver Medals  Bronze Medals  Total Medals
Year
2000           12             26             35          73.0
2002            5              2              0           7.0
2004           14             28             10          52.0
2006           14              3              2          19.0
2008           41             11             26          78.0
2010            6             10              2          18.0
2012           18             13             30          61.0

In [11]:
# 2. 대한민국의 선수별 총메달 개수 구하기 (금, 은, 동 순으로 정렬)

# 'Athlete'를 기준으로 Groupby를 진행한다. -> sum() 통계함수로 메달의 합을 구하고 그 중에서 메달에 관련한 Column만 추출한다.
kr_result_by_athlete = korea_result.groupby('Athlete').sum()[['Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals']]

# 금은동을 기준으로(by), 내림차순으로(ascending=False), row를 중심으로(axis=0) sort_values() 를 진행한다.
kr_result_by_athlete.sort_values(by=['Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals'], axis=0, ascending=False)

                  Gold Medals  Silver Medals  Bronze Medals  Total Medals
Athlete
Jin Jong-O                  3              2              0           5.0
Park Seong-Hyeon            3              1              0           4.0
An Hyeon-Su                 3              0              1           4.0
Jin Seon-Yu                 3              0              0           3.0
Yun Mi-Jin                  3              0              0           3.0
...                       ...            ...            ...           ...
Song Myeong-Seop            0              0              1           1.0
Yang Tae-Yeong              0              0              1           1.0
Yoon Jae-Young              0              0              1           1.0
Yu Ji-Hye                   0              0              1           1.0
Yun Seok-Yeong              0              0              1           1.0

[232 rows x 4 columns]